Repository: DavidKarlas/simple-task-manager
Catalog: client/src/locale/messages.*.xlf
Languages: de, fr

source: Welcome {{userName}} :)
de: Willkommen {{userName}} :)
fr: Bienvenue {{userName}} :)

source: Language selection:
de: Sprachauswahl:
fr: Langue :

source: Logout
de: Abmelden
fr: Déconnexion

source: Welcome to the SimpleTaskManager for <a>OpenStreetMap</a>
de: Willkommen beim SimpleTaskManager für <a>OpenStreetMap</a>

source: Login
de: Anmelden
fr: Connexion

source: <p><b>Changes in 1.1.0:</b></p> New features: <ul> <li>Internationalization:</li> <ul> <li>Translation of STM into Chinese, German and Japanese</li> <li>Selection dialog to change the language</li> <li>Selected language stored in the browsers local storage</li> </ul> <li>Button to open task in iD</li> <li>Button to directly set a task as 'done'</li> <li>Longer token validity (your login is now valid for one week)</li> <li>Check GeoJSON format of each new task</li> </ul> Bug fixes: <ul> <li>Missing feedback on overpass error</li> <li>Reconnect on broken websocket connection</li> </ul> Minor changes: <ul> <li>Zoom to selected task when not visible on the screen</li> <li>Progress percentage in project list</li> <li>Automatic names of tasks (the numbers of unnamed now start at 1 in each new project)</li> </ul> Internals: <ul> <li>Store project-ID in task database table</li> <li>Create project and tasks within one HTTP request</li> <li>Introduce the <code>context</code> to add a logging trace-ID</li> <li>Better server side logging</li> <li>Reconnect to database after connection failure</li> <li>Source maps in karma tests</li> </ul>
de: <p><b>Änderungen in 1.1.0-dev:</b></p> Neue Funktionen: <ul> <li>Internationalization:</li> <ul> <li>Übersetzung vom STM ins Chinesische, Deutsche und Japanische</li> <li>Auswahlmenü zum Andern der Sprache</li> <li>Speichern der Sprache im local storage vom Browser</li> </ul> <li>Button zum Öffnen eines Tasks iD</li> <li>Button um einen Task direkt als 'fertig' zu markieren</li> <li>Längere Login-Dauer (man ist nun eine Woche lang eingeloggt)</li> <li>Prüfe GeoJSON-Format jedes neuen Tasks</li> </ul> Behobene Fehler: <ul> <li>Fehlende Rückmeldung bei einem Overpass-Fehler</li> <li>Wiederaufbau kaputter Websocket-Verbindungen</li> </ul> Kleinere Änderungen: <ul> <li>Zoom auf ausgewählten Task, wenn dieser nicht sichtbar ist</li> <li>Prozentualer Fortschritt in Projektliste</li> <li>Automatische Namen für Tasks (die Nummern der Tasks beginnen bei jedem neuen Projekt nun bei 1)</li> </ul> Internes: <ul> <li>Die Projekt-ID wird nun in der Task-Tabelle gespeichert</li> <li>Projekte samt Tasks werden nun in einer HTTP-Anfrage erstellt</li> <li>Einführung eines <code>context</code> um eine Trace-ID zum logging zu haben</li> <li>Besseres Logging im Server</li> <li>Erneutes Verbinden mit der Datenbank, wenn die Verbindung kaputt gegangen ist</li> <li>Source-Maps in karma Tests</li> </ul>

source: Succesfully logged in :)
de: Erfolgreich eingeloggt :)
fr: Connexion réussie :)

source: Projects
de: Projekte
fr: Projets

source: You currently don't have any projects.
de: Du hast derzeit keine Projekte.
fr: Vous n'avez actuellement aucun projet.

source: Create project
de: Projekt erstellen
fr: Créer un projet

source: * you own this project
de: * Du besitzt dieses Projekt
fr: * vous êtes propriétaire de ce projet

source: < Back
de: < Zurück

source: Description:
de: Beschreibung:

source: Users
de: Benutzer

source: Settings
de: Einstellungen

source: Tasks
de: Aufgaben

source: (you)
de: (du)
fr: (vous)

source: Assign to me
de: Mir zuweisen
fr: Me l'assigner

source: Assigned to: {{assignedUserName}}
de: Zugewiesen an: {{assignedUserName}}
fr: Assigé à : {{assignedUserName}}

source: Unassign
de: Freigeben
fr: Libérer

source: Points:
de: Punkte:

source: Save
de: Speichern

source: Open in JOSM
de: In JOSM öffnen
fr: Ouvrir dans JOSM

source: Open in iD
de: In iD öffnen
fr: Ouvrir dans iD

source: Version: <a>{{version}}</a><span></span>Code: <a>GitHub</a><span></span>License: <a>GPLv3</a><span></span>Icons: <a>Linearicons</a>
de: Version: <a>{{version}}</a><span></span>Code: <a>GitHub</a><span></span>Lizenz: <a>GPLv3</a><span></span>Symbole: <a>Linearicons</a>

source: < Cancel
de: < Abbrechen

source: Save
de: Speichern

source: Properties:
de: Eigenschaften:
fr: Propriétés :

source: Max. points per task:
de: Max. Punkte pro Task:
fr: Max. de points par tâche :

source: Create shapes:
de: Polygon erstellen:

source: Invite
de: Einladen
fr: Inviter

source: Delete Project
de: Projekt löschen
fr: Supprimer le projet

source: Really delete Project?
de: Dieses Projekt wirklich löschen?
fr: Vraiment supprimer le projet ?

source: No
de: Nein
fr: Non

source: Yes
de: Ja
fr: Oui

source: Leave project
de: Projekt verlassen
fr: Quitter le projet

source: Really leave Project?
de: Projekt wirklich verlassen?
fr: Vraiment quitter le projet ?

source: Save
de: Speichern
fr: Enregistrer

source: Done
de: Fertig
fr: Terminé

source: Loading ...
de: Lade ...
fr: Chargement ...

source: ERROR:
de: FEHLER:
fr: ERREUR :

source: {{ remainingErrors }} errors left
de: {{ remainingErrors }} weitere Fehler
fr: {{ remainingErrors }} erreurs restantes

source: Warning:
de: Warnung:

source: {{ remainingWarning }} warnings left
de: {{ remainingWarning }} weitere Warnungen
fr: {{ remainingWarning }} avertissements restants

source: {{ remainingInfo }} notifications left
de: {{ remainingInfo }} weitere Meldungen
fr: {{ remainingInfo }} notifications restantes

source: This divides the last drawn polygon into the selected shape. Beware, all other shapes will be removed.
de: Dies teilt das letzte gezeichnete Polygon in die ausgewählte Form. Vorsicht, alle anderen Formen werden entfernt.

source: Select task
de: Task auswählen

source: Task selected
de: Task ausgewählt

source: Shape size:
de: Polygongröße:
fr: Taille de la forme :

source: meters
de: meter
fr: mètres

source: Shape:
de: Form:
fr: Forme :

source: square
de: Quadrat
fr: carré

source: triangle
de: Dreieck

source: Divide
de: Teilen
fr: Diviser

source: Upload a GPX, OSM or GeoJSON file, which contains polygons. Each polygon will result in a single task.
de: Eine GPX-, OSM- oder GeoJSON-Datei hochladen, die Polygone enthält. Jedes Polygon wird zu einem eigenen Task.

source: Upload file
de: Datei hochladen
fr: Téléverser un fichier

source: URL to OSM-XML:
de: URL zu OSM-XML Daten:

source: Load
de: Laden
fr: Charger

source: Loading data from Overpass:
de: Lade Daten von Overpass:
fr: Chargement de données depuis Overpass :

source: Create your query
de: Erstelle deine Abfrage
fr: Créer votre requête

source: Click on "Export"
de: Klicke auf "Export"
fr: Cliquer sur "Exporter"

source: Copy the link after "raw data directly from" (right click and "copy link")
de: Kopiere den Link nach "raw data directly from" (Rechtsklick und dann "Link kopieren")
fr: Copier le lien après "données brutes depuis" (clic-droit et "Copier l'adresse du lien")

source: Paste this URL in here
de: Füge die URL hier ein
fr: Coller l'URL ici

# WARN_AUTH_FAIL
source: Logout because authorization was not successful
de: Logout aufgrund fehlgeschlagener Anmeldung
fr: Échec d'authentification, déconnexion

# ERROR_NOT_CREATE_PROJ
source: Could not create project
de: Konnte Projekt nicht erstellen
fr: Impossible de créer le projet

# ERROR_LOAD_PROJECTS
source: Could not load projects
de: Konnte Projekte nicht laden
fr: Impossible de charger les projets

# ERROR_LIVE_UPDATE
source: Could not initialize live-updates
de: Konnte Live-Aktualisierungen nicht initialisieren
fr: Impossible d'initialiser les mises à jour en temps réel

# ERROR_COULD_NOT_UPLOAD
source: Could not upload file '{{interp}}'
de: Konnte die Datei '{{interp}}' nicht hochladen
fr: Impossible de téléverser le fichier '{{interp}}'

# ERROR_PARSING_OSM_DATA
source: Error parsing loaded OSM data
de: Fehler beim Einlesen von geladenen OSM-Daten

# ERROR_OVERPASS_NO_POLYGONS
source: No usable polygons have been found. Make sure the output format is set to 'out:xml' and the result contains actual polygons.
de: Keine Polygone gefunden. Es müssen der Parameter 'out:xml' gesetzt und tatsächliche Polygone vorhanden sein.

# ERROR_UNABLE_LOAD_URL
source: Unable to load data from remote URL
de: Konnte Daten nicht von URL laden
fr: Impossible de charger les données depuis l'URL

# WARN_ALREADY_MEMBER
source: User '{{interp}}' is already a member of this project
de: Nutzer '{{interp}}' ist bereits ein Mitglied des Projektes
fr: L'utilisateur '{{interp}}' est déjà membre de ce projet

# ERROR_USER_ID
source: Could not load user ID for user '{{interp}}'
de: Konnte ID für Nutzer '{{interp}}' nicht laden. Es muss mindestens ein Änderungssatz oder Hinweis vom Nutzer existieren.

# ERROR_UNABLE_LOAD_USER
source: Unable to load assigned user
de: Konnte zugewiesenen Nutzer nicht laden
fr: Impossible de charger l'utilisateur assigné

# ERROR_ASSIGN_USER
source: Could not assign user
de: Konnte Nutzer nicht zuweisen
fr: Impossible d'assigner à l'utilisateur

# ERROR_UNASSIGN_USER
source: Could not unassign user
de: Konnte Zuweisung nicht aufheben
fr: Impossible de libérer l'utilisateur

# ERROR_PROCESS_POINTS
source: Could not set process points
de: Konnte Punkte nicht setzen
fr: Impossible de définir les points de traitement

# ERROR_OPEN_JOSM
source: Unable to open JOSM. Is it running?
de: Konnte JOSM nicht öffnen. Hast du JOSM gestartet?
fr: Impossible d'ouvrir JOSM. Est-il lancé?

# ERROR_NOT_LOAD_PROJ
source: Could not load project '{{interp}}'
de: Konnte Projekt '{{interp}}' nicht laden
fr: Impossible de charger le projet '{{interp}}'

# ERROR_ONT_DELETE_PROJ
source: Could not delete project
de: Konnte das Projekt nicht löschen
fr: Impossible de supprimer le projet

# INFO_REMOVED_PROJ
source: Project removed successfully
de: Projekt erfolgreich gelöscht
fr: Projet supprimé

# ERROR_LEAVE_PROJ
source: Could not leave project
de: Konnte Projekt nicht verlassen
fr: Impossible de quitter le projet

# INFO_SUCCESS_UPDATE_PROJ
source: Successfully updated project
de: Projekt erfolgreich aktualisiert
fr: Projet mis à jour

# ERROR_UPDATE_PROJ_TITLE
source: Unable to update project title and/or description
de: Konnte Titel und/oder Beschreibung nicht aktualisieren
fr: Impossible de mettre à jour le titre et/ou la description

# WARN_PROJECT_REMOVED
source: The project '{{interp}}' has been removed
de: Das Projekt '{{interp}}' wurde entfernt

# WARN_REMOVED_USER_PROJECT
source: You have been removed from project '{{interp}}'
de: Du wurdest aus dem Projekt '{{interp}}' entfernt
fr: Vous avez été supprimé du projet '{{interp}}'

# ERROR_NOT_REMOVE_USER
source: Could not remove user
de: Konnte Nutzer nicht entfernen
fr: Impossible de supprimer l'utilisateur

# ERROR_NOT_INVITE_USER
source: Could not invite user {{interp}}
de: Konnte Nutzer {{interp}} nicht einladen

# TABS_TASKS
source: Tasks
de: Aufgaben
fr: Tâches

# TABS_USERS
source: Users
de: Benutzer
fr: Utilisateurs

# TABS_SETTINGS
source: Settings
de: Einstellungen
fr: Paramètres

# TABS_SUBDIVIDE
source: Draw
de: Aufteilen

# TABS_UPLOAD
source: Upload
de: Hochladen

# TASK_MAP_DONE
source: DONE
de: FERTIG
fr: TERMINÉ

# TASK_YOU
source: you
de: du
fr: vous

source: Zoom in
de: Vergrößern
fr: Zoomer

source: Zoom out
de: Verkleinern
fr: Dézoomer

source: Draw new polygon
de: Neues Polygon zeichnen
fr: Dessiner un nouveau polygone

source: Edit polygon
de: Polygon bearbeiten
fr: Éditer polygone

source: Remove polygon
de: Polygon entfernen
fr: Supprimer polygone

source: Duplicate:
fr: Copie:

source: Welcome to the SimpleTaskManager for <a>OpenStreetMap</a>
fr: Bienvenue sur SimpleTaskManager pour <a>OpenStreetMap</a>

source: Back
fr: Retour

source: Project: {{project?.name}}
fr: Projet: {{project?.name}}

source: Users:
fr: Utilisateurs:

source: Settings:
fr: Paramètres:

source: Version: <a>{{version}}</a><span></span>Code: <a>GitHub</a><span></span>License: <a>GPLv3</a><span></span>Icons: <a>Linearicons</a>
fr: Version : <a>{{version}}</a><span></span>Code : <a>GitHub</a><span></span>Licence : <a>GPLv3</a><span></span>Icônes : <a>Linearicons</a>

source: Cancel
fr: Annuler

source: Save
fr: Enregistrer

source: Tasks:
fr: Tâches :

source: Subdivide:
fr: Subdiviser :

source: Name:
fr: Nom :

source: WARNING:
fr: ALERTE:

source: This divides the selected task into smaller tasks of the selected shape and size.
fr: Divise la tâche selectionnée en plus petites tâches de la forme et taille sélectionnée.

source: hexagon
fr: hexagone

source: Preview
fr: Prévisualiser

source: Upload a GeoJSON, OSM-XML, GPX, EsriJson, KML or WKT file, which contains polygons. Each polygon will result in a single task.
fr: Téléverser un fichier GeoJSON, OSM-XML, GPX, EsriJson, KML ou WKT contenant des polygones. Chaque polygone deviendra une tâche.

source: URL to GeoJSON, OSM-XML, GPX, EsriJson, KML or WKT data:
fr: URL vers les données GeoJSON, OSM-XML, GPX, EsriJson, KML ou WKT :

# ERROR_USER_ID
source: Could not load user ID for user '{{interp}}'. The user must have at least one changeset or note.
fr: Impossible de charger l'ID de l'utilisateur '{{interp}}'. The user must have at least one changeset or note.

# WARN_PROJECT_REMOVED
source: The project '{{interp}}' has been removed
fr: Le projet '{{interp}}' a été supprimé

# ERROR_NOT_INVITE_USER
source: Could not invite user '{{interp}}'
fr: Impossible d'inviter l'utilisateur '{{interp}}'

# TABS_IMPORT
source: Import
fr: Importation

# TABS_REMOTE
source: Remote
fr: Distant

# TABS_PROPERTIES
source: Properties
fr: Propriétés

source: There are no tasks here yet. Use the pencil-tool to draw tasks or import tasks via the "Upload" or "Remote" tab.
fr: Il n'y a pas encore de tâche ici. Utiliser l'outil crayon pour dessiner des tâches, ou importer des tâches via les onglets "Téléversement" ou "Distant".
